data/run-A-short-context/bench_stdout_2048_trial2.log
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fbc418fc8b0>, trust_remote_code=False, seed=0, num_prompts=2488, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1784, random_output_len=256, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', header=None, max_concurrency=311, model='mistral-3-14B', input_len=None, output_len=None, tokenizer='mistralai/Ministral-3-14B-Instruct-2512-BF16', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir=None, result_filename='/root/mktg3270_logs/bench_2048_trial2.json', ignore_eos=False, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-228cc449-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-26 21:18:07 [config.py:389] Inferred from consolidated*.safetensors files torch.bfloat16 dtype.
INFO 08-26 21:18:08 [utils.py:90] Sampling input_len from [1783, 1783] and output_len from [256, 256]
WARNING 08-26 21:18:17 [datasets.py:683] Across all generated prompts, there were 5 more tokens than expected after decoding and re-encoding. This is expected due to the imperfect nature of the sampling procedure.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 311
100%|██████████| 2488/2488 [04:26<00:00,  9.35it/s] 
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     2488      
Failed requests:                         0         
Maximum request concurrency:             311       
Benchmark duration (s):                  266.07    
Total input tokens:                      4438597   
Total generated tokens:                  636928    
Request throughput (req/s):              9.35      
Output token throughput (tok/s):         2393.88   
Peak output token throughput (tok/s):    7775.00   
Peak concurrent requests:                333.00    
Total token throughput (tok/s):          19076.24  
---------------Time to First Token----------------
Mean TTFT (ms):                          2534.45   
Median TTFT (ms):                        1093.82   
P99 TTFT (ms):                           22145.69  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          120.14    
Median TPOT (ms):                        125.67    
P99 TPOT (ms):                           128.06    
---------------Inter-token Latency----------------
Mean ITL (ms):                           120.15    
Median ITL (ms):                         42.05     
P99 ITL (ms):                            367.55    
==================================================